We have: 351.000 users, 192.000 with >= 10 reviews; 19.330 games with >= 30 reviews, 10.600 games with >=100 reviews, 7.000 games with >=200 reviews, 2.500 games with >= 1000 reviews

(users with >=10 reviews & games with >=100 reviews) gives us 14.8 mil records out of 15mil ...

In [1]:
import pandas as pd

In [2]:
df = pd.read_csv("bgg.csv")

In [3]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 15823269 entries, 0 to 15823268
Data columns (total 4 columns):
 #   Column      Dtype
---  ------      -----
 0   Unnamed: 0  int64
 1   ID          int64
 2   user        object
 3   rating      float64
dtypes: float64(1), int64(2), object(1)
memory usage: 482.9+ MB

In [4]:
df.drop("Unnamed: 0", axis = 1, inplace=True)
df.dropna(inplace = True)

In [5]:
df.head()

      ID             user  rating
0  30549          Torsten    10.0
1  30549  mitnachtKAUBO-I    10.0
2  30549           avlawn    10.0
3  30549       Mike Mayer    10.0
4  30549          Mease19    10.0

In [6]:
table_user = df.groupby(["user"]).ID.count().reset_index()

In [7]:
table_user.head()

                user  ID
0          Fu_Koios    2
1           beastvol   9
2            mycroft  14
3                woh   5
4  (mostly) harmless   1

In [8]:
print(len(table_user), len(table_user[table_user.ID>30]))

351048 111677

In [9]:
print(len(table_user), len(table_user[table_user.ID>9]))

351048 192093

In [10]:
table_games = df.groupby(["ID"]).user.count().reset_index()
table_games

           ID   user
0           1   5089
1           2    544
2           3  14392
3           4    337
4           5  17838
...       ...    ...
19325  309113     45
19326  310100     49
19327  312804     94
19328  313850     79
19329  314040     98

[19330 rows x 2 columns]

In [11]:
print(len(table_games), len(table_games[table_games.user >= 100]))

19330 10617

In [12]:
games_reviewed_100 = table_games[table_games.user >= 100]
len(games_reviewed_100)

10617

In [13]:
users_review_10 = table_user[table_user.ID >= 10]
len(users_review_10)

192093

In [14]:
new = df[(df.ID.isin(games_reviewed_100.ID) == True) & (df.user.isin(users_review_10.user) == True)]

In [15]:
len(new)

14872931

In [17]:
new.to_csv("bgg_100_10.csv", index = False)